#+TITLE: Linux指南
#+ORGA_PUBLISH_KEYWORD: DONE

* xargs :Linux:Command:Guide:
xargs命令的作用，是将标准输入转为命令行参数。

#+begin_src shell
echo "Without xargs" | echo
echo "With xargs" | xargs echo
#+end_src

#+RESULTS:
|            |
| With xargs |

#+begin_src shell
echo -e "a\tb\tc" | xargs -d "\t" echo
#+end_src

#+RESULTS:
: a b c
